InformationRegisters/Лог_ЗапретРедактированияДокументовВыдачиПодарков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>Лог_ЗапретРедактированияДокументовВыдачиПодарков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПредыдущееЗначение</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущееЗначение</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Constants/ДатаЗапретаРедактированияДокументовВыдачиПодарков/Ext/ValueManagerModule.bsl
Процедура ПриЗаписи(Отказ)
	ЛогТекущееЗначение = ТекущееЗначениеКонстанты();
	Если ЭтотОбъект.Значение = ЛогТекущееЗначение Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДата();
	ТекущееЗначение = ЭтотОбъект.Значение;
	МенеджерЗаписи = РегистрыСведений.Лог_ЗапретРедактированияДокументовВыдачиПодарков.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Дата = ТекущаяДата;
	МенеджерЗаписи.ТекущееЗначение = ТекущееЗначение;
	МенеджерЗаписи.ПредыдущееЗначение = ЛогТекущееЗначение;
	Если ОбменДанными.Загрузка Тогда
		МенеджерЗаписи.Событие = "Загрузка даты из УТ";
	Иначе
		МенеджерЗаписи.Событие = "Изменение даты запрета редактирования";
	КонецЕсли;
	МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.Записать(Ложь);
КонецПроцедуры

Функция ТекущееЗначениеКонстанты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Лог_ЗапретРедактированияДокументовВыдачиПодарков.ТекущееЗначение
		|ИЗ
		|	РегистрСведений.Лог_ЗапретРедактированияДокументовВыдачиПодарков КАК Лог_ЗапретРедактированияДокументовВыдачиПодарков
		|
		|УПОРЯДОЧИТЬ ПО
		|	Лог_ЗапретРедактированияДокументовВыдачиПодарков.Дата УБЫВ";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ТекущееЗначение;
	КонецЦикла;
	
КонецФункции
